9/data/attachments/ec57b40ef3ce9b77.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_8f9509b4-4cfb-43f9-9e9d-1a7601f3ac5e</nif:username>
            <nif:friendToBeAdded>Brittany_even_Friend_56149_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>